tap "aws/tap"
tap "cartr/qt4"
tap "codekitchen/dinghy"
tap "d12frosted/emacs-plus"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "helm/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "norwoodj/tap"
tap "weaveworks/tap"
brew "act"
brew "xz"
brew "awscli"
brew "azure-cli"
brew "circleci"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
brew "deno"
brew "docker-machine"
brew "exercism"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnutls"
brew "go"
brew "helm"
brew "htop"
brew "node"
brew "http-server"
brew "httrack"
brew "hub"
brew "jq"
brew "kube-ps1"
brew "kubeval"
brew "libpng"
brew "mas"
brew "minikube"
brew "netpbm"
brew "nvm"
brew "pandoc"
brew "podman"
brew "postgresql@14"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "tcl-tk"
brew "telnet"
brew "tmux"
brew "tree"
brew "watch"
brew "zlib"
brew "zsh"
cask "adoptopenjdk8"
cask "alt-tab"
cask "anki"
cask "aws-vault"
cask "background-music"
cask "balenaetcher"
cask "cheatsheet"
cask "coconutbattery"
cask "cyberduck"
cask "dash"
cask "discord"
cask "disk-drill"
cask "docker"
cask "dotnet-sdk"
cask "font-fira-code"
cask "graphiql"
cask "graphql-playground"
cask "handbrake"
cask "ibm-cloud-cli"
cask "imageoptim"
cask "insomnia"
cask "keka"
cask "keycastr"
cask "mongodb-compass"
cask "mysqlworkbench"
cask "paintbrush"
cask "pgadmin4"
cask "pomotroid"
cask "postman"
cask "screaming-frog-seo-spider"
cask "sdformatter"
cask "teamviewer"
cask "vlc"
cask "vnc-viewer"
cask "vox"
cask "wireshark"
cask "xquartz"
cask "zenmap"
cask "zoom"
mas "Cinebench", id: 1438772273
mas "Disk Speed Test", id: 425264550
mas "EuDic", id: 434350458
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LanScan", id: 472226235
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ScreenBrush", id: 1233965871
mas "Slack", id: 803453959
mas "Smart Countdown Timer", id: 1410709951
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "WeChat", id: 836500024
