tap "cartr/qt4"
tap "codekitchen/dinghy"
tap "d12frosted/emacs-plus"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Command-line interface for SQLite
brew "sqlite"
# Tool Command Language
brew "tcl-tk"
# Record and share terminal sessions
brew "asciinema"
# Library for manipulating PNG images
brew "libpng"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Command-line tool to interact with exercism.io
brew "exercism"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Distributed revision control system
brew "git"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Website copier/offline browser
brew "httrack"
# Add GitHub support to git on the command-line
brew "hub"
# Load testing and performance measurement application
brew "jmeter"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GUI for vim, made for macOS
brew "macvim", link: false
# Mac App Store command-line interface
brew "mas"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql"
# Python version management
brew "pyenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# General-purpose lossless data-compression library
brew "zlib"
# faster, friendlier Docker on OS X
brew "codekitchen/dinghy/dinghy"
# Terraform
brew "hashicorp/tap/terraform"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Server and cloud storage browser
cask "cyberduck"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Data recovery software
cask "disk-drill"
# App to build and share containerized applications and microservices
cask "docker"
# Easiest way to get started with Electron
cask "electron-fiddle"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
cask "font-fira-code"
# Tool to measure the computer system's performance
cask "geekbench"
# Web browser
cask "google-chrome"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
cask "graphql-playground"
# Open-source video transcoder
cask "handbrake"
# Tool to optimize images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# File archiver
cask "keka"
# Open-source keystroke visualizer
cask "keycastr"
# GPU-based terminal emulator
cask "kitty"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Full TeX Live distribution with GUI applications
cask "mactex"
cask "mongodb-compass"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Open-source software for live streaming and screen recording
cask "obs"
# Image editor
cask "paintbrush"
cask "pgadmin4"
# Timer application
cask "pomotroid"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Wireless screen-mirroring application
cask "reflector"
cask "screaming-frog-seo-spider"
# Team communication and collaboration software
cask "slack"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Integrated development environment
cask "visual-studio-code-insiders"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Music player for high resoluion (Hi-Res) music through the external sources
cask "vox"
# Network protocol analyzer
cask "wireshark"
# Multi-platform graphical interface for official Nmap Security Scanner
cask "zenmap"
# Video communication and virtual meeting platform
cask "zoom"
mas "Cinebench", id: 1438772273
mas "Disk Speed Test", id: 425264550
mas "EuDic", id: 434350458
mas "Gifski", id: 1351639930
mas "iMovie", id: 408981434
mas "iMuscle 2", id: 580090604
mas "iZip Unarchiver", id: 717545828
mas "Kindle", id: 405399194
mas "LanScan", id: 472226235
mas "Microsoft Remote Desktop", id: 1295203466
mas "ScreenBrush", id: 1233965871
mas "Smart Countdown Timer", id: 1410709951
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "WeChat", id: 836500024
